<?php
defined('BASEPATH') OR exit('No direct script access allowed');

$config['code'] = array(

    //系统相关
    0 => '操作成功',
    500 => '系统错误',

    //用户相关
    10001 => 'code不能为空',
    10002 => '用户未登录',
    10003 => '签名错误',
    10004 => '',
    10005 => '',
    10006 => '',

    11001 => '入参错误',
    11002 => '操作失败',
    11003 => '',
    11004 => '',
    11005 => '',
    11006 => '',
    11007 => '',
    11008 => '',
    11009 => '',
    11010 => '',
    11011 => '',

    //产品相关
    20001 => '请选择家居类型!',
    20002 => '请选择家居风格!',
    20003 => '请选择产品',
    20004 => '产品已被下架或删除！',
    20005 => '产品已收藏',
    20006 => '',
    20007 => '',
    20008 => '',
    20009 => '',
    20010 => '',
    20011 => '',
    20012 => '',

    // 操作中
    210001 => '数据读写失败',


    // 操作后
    220001 => '添加数量不能大于商品库存',
    220002 => '购物车及选添数量大于商品库存',

    //签到相关
    410001 => '今天已签到',
    410002 => '签到失败，请重试！',

    //文件上传
    90000 => '未知错误',
    90001 => '文件上传失败',
    90002 => '入参错误',
    90003 => '请上传4M以下的图片',
    90004 => '上传的文件超出了提交表单允许的最大大小',
    90005 => '该文件只是部分上传成功',
    90006 => '临时文件夹丢失,请稍后重试',
    90007 => '文件不能写入磁盘,请联系客服',
    90008 => '文件上传被停止, 请稍后重试',
    90009 => '没有文件被上传',
    90010 => '上传的文件类型不受支持,请尝试其他类型文件',
    90011 => '文件过大，请上传4M以下的图片',
    90012 => '上传的文件尺寸不受支持',
    90013 => '出现异常，请稍后重试',
    90014 => '上传路径无效，请联系客服',
    90015 => '不支持此文件类型，请尝试其他类型文件',
    90016 => '您提交的文件名已经存在于服务器上',
    90017 => '上传的目标文件夹不可写，请联系客服',

);
